_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dropout_4 (Dropout)          (None, 512)               0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 512)               2048      
_________________________________________________________________
dense_4 (Dense)              (None, 30)                15390     
_________________________________________________________________
dropout_5 (Dropout)          (None, 30)                0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 30)                120       
_________________________________________________________________
activation_3 (Activation)    (None, 30)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 20)                620       
_________________________________________________________________
dropout_6 (Dropout)          (None, 20)                0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 20)                80        
_________________________________________________________________
activation_4 (Activation)    (None, 20)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 21        
=================================================================
Total params: 18,279
Trainable params: 17,155
Non-trainable params: 1,124
_________________________________________________________________
